content/post/se-iniciando-no-machine-learning.md
+++
title = "Se iniciando no machine learning"
date = 2017-08-25
lastmod = 2024-02-20T23:09:25-03:00
draft = false
weight = 2013
url = "/post/3"
description = "A história de como comecei os estudos em Machine Learning."
+++

Há aproximadamente duas semanas, comecei um curso online no [Coursera](https://www.coursera.org/learn/machine-learning), chamado de
introdução ao Machine Learning, e este apresenta uma introdução ao _supervised
learning_, e ao unsupervised learning, detalhando cada um, e depois você precisa
implementá-los e tal, bem interessante para quem quer começar a entrar ná área.
Lá você aprende o funcionamento interno das coisas, não é só simplesmente baixar
uma biblioteca e começar a usar, acho isso bem interessante porque você acaba
entendendo melhor as aplicações para cada caso diferente.


## O curso {#o-curso}

A linguagem utilizada no curso é Octave ou Matlab, sendo a primeira opensource,
e a segunda é disponibilizada uma licença gratuita que dura té o fim do
cursinho, recomendo usá-la, porque depois o programa passa a custa $600,00 para
estudantes **(ai meu rim!)**.

Dica marota: Eu sempre estudei em escola pública, então a maioria do meu
conhecimento matemático é autodidata (rs), e o curso já se inicia com uma
notação matemática fora do comum pra quem não é acostumado. Eu no caso tive que
ir ao Khan Academy dar um estudada em cálculo para tentar entender o que estava
acontencendo. Observe que isso não é necessário, eu que tive essa vontade mesmo,
além de que o próprio professor avisa que não necessário derivar e etc.


## E depois? {#e-depois}

Existe um site muito legal que acabei conhecendo, chamado [Kaggle](https://www.kaggle.com/). Nele há
"competições" criada pelos usuários ou pela própria staff do site, como o Kaggle
[Titanic](https://www.kaggle.com/c/titanic) (bem famoso), onde é dado um data set e dali você tira suas análises.
